//Функция производит сериализацию в XML структуру переданного объекта, ссылки или 
//переменной произвольного сериализуемого типа
Функция СериализоватьXML(ОбъектСериализации) экспорт
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации); 
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку(); 
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ДеревоВОбъектеXDTO); 
	Возврат ЗаписьXML.Закрыть(); 
КонецФункции

//создаёт объект, переменную, структуру или коллекцию на основе переданной XML структуры
Функция ДесериализоватьXML(СериализованныйОбъект) экспорт
	ЧтениеXMLДанных = Новый ЧтениеXML; 
	ЧтениеXMLДанных.УстановитьСтроку(СериализованныйОбъект); 
	ДесериализованныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных); 
	ЧтениеXMLДанных.Закрыть(); 
	Возврат ДесериализованныйОбъект; 
КонецФункции
